/*
SQLyog Ultimate v8.32 
MySQL - 5.5.28 : Database - 0514_db
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
CREATE DATABASE /*!32312 IF NOT EXISTS*/`0514_db` /*!40100 DEFAULT CHARACTER SET utf8 */;

USE `0514_db`;

/*Table structure for table `goods` */

DROP TABLE IF EXISTS `goods`;

CREATE TABLE `goods` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(255) DEFAULT NULL,
  `price` double(10,2) DEFAULT NULL,
  `picture` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=69 DEFAULT CHARSET=utf8;

/*Data for the table `goods` */

insert  into `goods`(`id`,`name`,`price`,`picture`) values (1,'G8 中原G8三合一浓醇咖啡固体饮料1200',66.50,'d856e4ec-6686-4164-b6ff-1322f4d483f4.jpg'),(2,'百草味东北松子200gx2袋 坚果炒货零',42.90,'2.jpg'),(3,'奈津香 桂圆干500gx2袋莆田特产5A桂',39.90,'3.jpg'),(4,'益达尊享护齿装草本40粒+冰柠40粒+西',25.90,'4.jpg'),(5,'猴坑茶业2016新茶原产地手工太平猴魁特',168.00,'5.jpg'),(6,'嘻鱿记 休闲零食 麻辣香辣奶香炭烧 5种',39.80,'6.jpg'),(7,'荣业鸿福五分瘦腊肠 香港土特产香肠腊味',126.80,'7.jpg'),(8,'蓓琳娜（BELLINA）3L PDO特级初榨橄榄油',178.00,'8.jpg'),(10,'荣业鸿福五分瘦腊肠 香港土特产香肠腊味',30.60,'f8737099-eff2-44bb-84ac-bd9295cf25f7.png'),(12,'中华香烟',100.00,'6.jpg'),(13,'中华香烟',100.00,'6.jpg'),(14,'中华香烟',100.00,'6.jpg'),(15,'中华香烟',100.00,'6.jpg'),(16,'中华香烟',100.00,'6.jpg'),(17,'中华香烟',100.00,'6.jpg'),(18,'中华香烟',100.00,'6.jpg'),(20,'中华香烟',100.00,'6.jpg'),(21,'中华香烟',100.00,'6.jpg'),(22,'中华香烟',100.00,'6.jpg'),(23,'中华香烟',100.00,'6.jpg'),(24,'中华香烟',100.00,'6.jpg'),(25,'中华香烟',100.00,'6.jpg'),(26,'中华香烟',100.00,'6.jpg'),(27,'中华香烟',100.00,'6.jpg'),(28,'中华香烟',100.00,'6.jpg'),(29,'中华香烟',100.00,'6.jpg'),(30,'中华香烟',100.00,'6.jpg'),(31,'中华香烟',100.00,'6.jpg'),(32,'中华香烟',100.00,'6.jpg'),(33,'中华香烟',100.00,'6.jpg'),(34,'中华香烟',100.00,'6.jpg'),(36,'中华香烟',100.00,'6.jpg'),(37,'中华香烟',100.00,'6.jpg'),(38,'中华香烟',100.00,'6.jpg'),(39,'中华香烟',100.00,'6.jpg'),(40,'中华香烟',100.00,'6.jpg'),(41,'中华香烟',100.00,'6.jpg'),(42,'中华香烟',100.00,'6.jpg'),(43,'中华香烟',100.00,'6.jpg'),(44,'中华香烟',100.00,'6.jpg'),(45,'中华香烟',100.00,'6.jpg'),(46,'中华香烟',100.00,'6.jpg'),(47,'中华香烟',100.00,'6.jpg'),(48,'中华香烟',100.00,'6.jpg'),(49,'中华香烟',100.00,'6.jpg'),(50,'中华香烟',100.00,'6.jpg'),(51,'中华香烟',100.00,'6.jpg'),(52,'中华香烟',100.00,'6.jpg'),(53,'中华香烟',100.00,'6.jpg'),(54,'中华香烟',100.00,'6.jpg'),(55,'中华香烟',100.00,'6.jpg'),(56,'中华香烟',100.00,'6.jpg'),(57,'中华香烟',100.00,'6.jpg'),(58,'中华香烟',100.00,'6.jpg'),(59,'中华香烟',100.00,'6.jpg'),(60,'中华香烟',100.00,'6.jpg'),(61,'中华香烟',100.00,'6.jpg'),(62,'中华香烟',100.00,'6.jpg'),(63,'中华香烟',100.00,'6.jpg'),(64,'中华香烟',100.00,'6.jpg'),(65,'中华香烟',100.00,'6.jpg'),(66,'中华香烟',100.00,'6.jpg'),(67,'中华香烟',100.00,'6.jpg'),(68,'中华香烟',100.00,'6.jpg');

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
